accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/customers/GetAccountLegalFlag-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/AccountManagement/GetAccountLegalFlag">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetAccountLegalFlagResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:AccountList>
                  <!--Zero or more repetitions:-->
                  <get:Account>
                     <get:CustomerID>?</get:CustomerID>
                     <get:LegalFlag>?</get:LegalFlag>
                  </get:Account>
               </get:AccountList>
            </lcew:Body>
         </Response>
      </web:GetAccountLegalFlagResponse>
   </soapenv:Body>
</soapenv:Envelope>